[
  {
    "_id": "0028608488",
    "title": "The Baseball Fan's Companion: How to Master the Subtleties of the World's Most Complex Team Sport and Learn to Watch the Game Like an Expert",
    "cover": "https://images.isbndb.com/covers/4318463482198.jpg",
    "genres": [
      "Baseball",
      "GV867 .B26 1996"
    ],
    "pages": 272,
    "year": 1996,
    "synopsis": "For The Fan Who Just Needs To Brush Up On America's Favorite Pastime To The Novice Learning The Finer Points Of The Game. The Baseball Fan's Companion Stands Ready At The Plate To Answer All Your Questions. From The Pitcher To The Hitter, The Strategy Of Each Position Is Covered, Complex Rules Are Explained, And Baseball Terminology Is Demystified. Intermingled In All This Handy Information Are Sidebars And Boxes Filled With Fun And Useful Tidbits--from The Most Frequently Unenforced Rules List To The Pine-tar Game, From Jimmy Piersall's Backwards Home Run To The Most Notorious Disputed Plays In Major League History. Hard-to-find Facts On The Business Side Of The Game Are Included Here As Well, Covering Everything From No-cut Contracts To Free Agency. Nick Bakalar. Subtitle On Cover: How To Watch The Game Like An Expert. Includes Bibliographical References (p. 203-205) And Index."
  },
  {
    "_id": "0029066824",
    "title": "The Left-Hander Syndrome : The Causes & Consequences of Left Handedness",
    "cover": "https://images.isbndb.com/covers/8901873482198.jpg",
    "genres": [
      "Left- and right-handedness",
      "Functional Laterality",
      "QP385.5 .C68 1992",
      "WL 335 C797L 1992",
      "152.3/35"
    ],
    "pages": 308,
    "year": 1992,
    "synopsis": "Beliefs And Stereotypes About Handedness -- The Lopsided Animal -- Measuring Sidedness -- Does Society Make Right-handers? -- Is Handedness Inherited? -- The Two Brains -- Psycho-neuro-astrology -- Is Left-handedness Pathological? -- The Sign Of The Left -- Left-hander Differences And Deficiencies -- Health And The Left-hander -- Do Left-handers Die Younger? -- A World For Right-handers -- The Hazardous Life Of The Southpaw -- Help For The Left-hander -- An Action Plan For Left-handers. Stanley Coren. Includes Bibliographical References (p. 282-294) And Indexes."
  },
  {
    "_id": "0060004339",
    "title": "Raising Blaze: A Mother and Son's Long, Strange Journey into Autism",
    "cover": "https://images.isbndb.com/covers/9333193482209.jpg",
    "pages": 316,
    "year": 2003,
    "synopsis": "<P>When you have a child that doesn't fit in, what do you do? Debra Ginsberg knew that her son, Blaze, was unique from the moment he was born in 1987. What she didn't know was that Blaze's differences would be regarded by the outside world not as gifts, but as impediments to social and academic success. Blaze never crawled. He just got up and walked when he turned one. He called his mother 'Zsa Zsa' until he was three. By kindergarten, he loved the music of Miles Davis and Ella Fitzgerald. He fears butterflies and is fascinated by garbage trucks. With the same honesty that made <i>Waiting</i> a success, <i>Raising Blaze&#58; Bringing Up an Extraordinary Son in an Ordinary World</i> chronicles Debra's experience in raising a child who has defied definition by the host of professionals who have sought to label his differences. Ginsberg introduces us to a remarkable child and her own unusual childhood. She writes about a family which shows us the redemptive power of faith, humour and love. <h3>The New Yorker</h3> A specific diagnosis of a disability may provide a welcome explanation for puzzling behavior, and even offer relief through medication or therapy. But as Debra Ginsberg explains in <I>Raising Blaze</I>, her memoir of bringing up her own \"extraordinary\" child, a diagnosis can sometimes create more questions than answers. Blaze, who was choked by his own umbilical cord during delivery, expresses himself with enigmatic figurative phrases; loud noises send him screaming around the room. The doctors' assessment was vague to the point of tautology: \"pervasive developmental disorder, not otherwise specified.\" Ginsberg struggles with the public-school system and its rigorous notions of acceptable behavior, where even happiness is monitored: \"I am struck again by how difficult it is to navigate a world where we have to be mindful of when laughter is appropriate.\" According to Jeanne Safer, in <a href=\"http://cart2.barnesandnoble.com/booksearch/isbnInquiry.asp?isbn=0743211960\"><I>The Normal One</I></a>, the families of disabled or difficult children also suffer. Inspired by her own troubled relationship with her brother, Safer sees \"normal\" siblings as suffering from \"Caliban syndrome.\" Her book tries to peek under the sentimental surface of most representations of disability (such as the TV star who told <I>Us</I> magazine that her mentally retarded sister was \"my love, my heart, my angel\"). She writes, \"Guilt is rarely absent from the thoughts of healthy adults about their damaged siblings because no amount of devotion or care can make the damaged whole or blot out the dark victory of their own normality.\" Though some draw away, others become martyrs, feeling inextricably bound to care uncritically for their less able brother or sister. And some, like Safer, reject the sibling, then write a book about it..<I>(Andrea Thompson)</I>"
  },
  {
    "_id": "0060199660",
    "title": "Prodigal Summer",
    "cover": "https://images.isbndb.com/covers/11286503482209.jpg",
    "pages": 640,
    "year": 2000,
    "synopsis": "over The Course Of One Humid Summer, As The Urge To Procreate Overtakes The Countryside, These Characters Find Their Connections To One Another And To The Flora And Fauna With Whom They Share A Place. With The Complexity That Characterizes Barbara Kingsolver&#39;s Finest Work, <i>prodigal Summer</i> Embraces Pure Thematic Originality And Demonstrates A Balance Of Narrative, Drama, And Ideas That Render It An Inspiring Work Of Fiction.<h3>creative Loafing</h3>... A Story Of The Many Ways To Define Family &#151; Human Or Not ... Full Of Joy, Warmth, And Sweet Surprise."
  },
  {
    "_id": "0060394307",
    "title": "The Water and the Blood: A Novel",
    "cover": "https://images.isbndb.com/covers/13232903482209.jpg",
    "genres": [
      "Young women",
      "Young women--Fiction",
      "PS3570.U725 W38 2001"
    ],
    "pages": 416,
    "year": 2001,
    "synopsis": "Nancy E. Turner."
  },
  {
    "_id": "0061052280",
    "title": "David Copperfield's Tales of the Impossible",
    "cover": "https://images.isbndb.com/covers/19812753482209.jpg",
    "genres": [
      "Fantasy Fiction, American"
    ],
    "pages": 385,
    "year": 1995,
    "synopsis": "David Copperfield, Arguably The Greatest Illusionist-magician Of Our Time, Has Called Upon The World's Finest And Most Respected Authors To Create A Thrilling Tribute To Magic And Illusion. Contributors Include Larry Bond, Ray Bradbury, Eric Lustbader, And Others."
  },
  {
    "_id": "0064402274",
    "title": "Dragon of the Lost Sea (Dragon Series)",
    "cover": "https://images.isbndb.com/covers/25226893482210.jpg",
    "pages": 224,
    "year": 1988,
    "synopsis": "The outlawed princess of the Dragon Clan and her young human companion undergo fearsome trials in their quest for an evil enchantress. 'Dramatic tension stays high. Weaves Chinese legend into an exciting tapestry of myth and folklore.' —BL.\nNotable Children's Books of 1982 (ALA)<br>\n100 Favorite Paperbacks of 1989 (IRA/CBC)\n\n\n                        Shimmer, a renegade dragon princess, tries to redeem herself by capturing a witch with the help of a human boy.\n"
  },
  {
    "_id": "0140252738",
    "title": "The Cat Who Came for Christmas",
    "cover": "https://images.isbndb.com/covers/25415133482237.jpg",
    "genres": [
      "Authors, American",
      "Biography",
      "Cat Owners",
      "Cats",
      "Anecdotes",
      "Animal Welfare"
    ],
    "pages": 240,
    "year": 1995,
    "synopsis": "A Handsomely Repackaged Edition Of The Perennial Holiday Best-seller Tells The Poignant And Often Hilarious Story Of An Avowed Curmudgeon And The Proud But Lovable Stray He Rescued One Christmas Eve. Reissue."
  },
  {
    "_id": "019832054X",
    "title": "King Lear (Oxford School Shakespeare Series)",
    "cover": "https://images.isbndb.com/covers/16291663482258.jpg",
    "genres": [
      "Shakespeare - Plays",
      "History",
      "& Criticism",
      "Family/Domestic Drama",
      "General & Miscellaneous Drama"
    ],
    "pages": 224,
    "year": 2002,
    "synopsis": "The Oxford School Shakespeare is a well-established series which helps students understand and enjoy Shakespeare's plays.Each play in the series contains the complete and unabridged text, together with a wide range of notes. These include detailed and clear explanations of difficult words and passages, a synopsis of the entire plot, summaries of individual scenes, and notes on the main characters.There are also line drawings to illustrate the notes and text, background information on Shakespeare's England, suggestions for further reading, a brief biography of Shakespeare, and a complete list of his plays."
  },
  {
    "_id": "0312140290",
    "title": "Puppy Preschool: Raising Your Puppy Right---Right from the Start!",
    "cover": "https://images.isbndb.com/covers/2971773482299.jpg",
    "pages": 260,
    "year": 1996,
    "synopsis": "No home with a puppy should be without <i>Puppy Preschool</i>.\nCongratulations! You have (or are thinking seriously of raising) a cute new puppy. He's warm, cuddly, great to hold and pet— and simply a lot of fun.\nBut watch out! Your adorable ball of fur can be a doggone handful. Given half the chance, he may take it upon himself to eat your furniture, terrorize the kids, dig up the garden, jump on your friends, and eliminate at the most inappropriate times.\nLet's face it, sometimes what you get raising a puppy can be a \"dog's breakfast\"— a mixed bag of happiness and hassle. In order to make it through puppyhood with your sanity still in tact, you need to enroll your pup in <i>Puppy Preschool</i>.\nHere, in <i>Puppy Preschool</i>, John Ross and Barbara McKinney, the country's foremost dog-training experts, reveal the benefits of early training in this definitive guide devoted exclusively to the trials and triumphs of puppy rearing. <i>Puppy Preschool</i> rewrites the rules on puppy training. While previous training books begin their programs when the puppy has already reached four months of age, <i>Puppy Preschool</i> begins educating and disciplining at just <i>eight weeks old</i>, the time when most puppies are brought into their new homes. Using surefire, revolutionary techniques, Ross and McKinney provide a much-needed head start on good behavior. They offer essential training rules that will be useful throughout your puppy's formative education, including information on:\n* The right breed for your family or your lifestyle\n* The ten best breeds for the home\n* Early leash and collar procedures\n* Housebreaking\n* Preventing unwanted chewing\n* Health and grooming tips\n* Emergency care\n* Essential puppy-training equipment and safe, fun toys\n* A breakdown of puppy development from birth to eighteen months\n* The best ways for small children to interact with puppies\ndn0\nBased on the same training philosophy presented in their classic book, <i>Dog Talk</i>, of raising your dog from a \"canine point of view,\" Ross and McKinney give easy-to-follow training techniques that will make puppy rearing a great experience for everyone involved.\n\n\n                        John Ross, the host of a Kal-Can cable TV infomercial on puppy training, and Barbara McKinney, the new editor of Dog Care, the largest dog magazine in the U.S., provide sure-fire, easy-to-follow training techniques that will help dog owners rear puppies properly and teach them good behavior right from the start.\n"
  },
  {
    "_id": "0312204663",
    "title": "Iron Lady: A Biographical Thriller",
    "cover": "https://images.isbndb.com/covers/3615413482299.jpg",
    "pages": 391,
    "year": 1999,
    "synopsis": "Trent Stanford, a Scotland Yard special agent, is given the responsibility by Margaret Thatcher to hunt down the men responsible for an attempt on her life. Stanford immediately suspects the IRA, but does not know that the assassin they've hired is the woman considered to be the most cold-blooded killer in the world and that the assassin's devilish plan hinges on a kidnapped six-year-old Chicago boy named Danny.\nStephen Forest's charged plot brings to mind the blockbuster first novels of David Baldacci and Tom Clancy; Iron Lady is destined for bestseller lists."
  },
  {
    "_id": "0316691178",
    "title": "Exiting Nirvana: A Daughter's Life with Autism",
    "cover": "https://images.isbndb.com/covers/20394783482300.jpg",
    "pages": 240,
    "year": 2001,
    "synopsis": "[redaktory-sostaviteli, B.a. Zilʹbert, O.b. Krasnova]. K 100-letii͡u Saratovskoĭ Konservatorii. Knizhnoe Izdanie--colophon. [редакторы-составители, Б.А. Зильберт, О.Б. Краснова]."
  },
  {
    "_id": "0345339681",
    "title": "The Hobbit",
    "cover": "https://images.isbndb.com/covers/26021933482310.jpg",
    "genres": [
      "Arkenstone",
      "Battle of Five Armies",
      "invisibility",
      "thrushes",
      "eagles",
      "hobbits",
      "wizards",
      "dragons",
      "dwarves",
      "elves",
      "men",
      "trolls",
      "goblins",
      "giant spiders",
      "the one ring",
      "juvenile fantasy",
      "YOUNG ADULT FICTION",
      "Fantasy fiction",
      "Juvenile fiction",
      "Fiction",
      "Fantasy",
      "Classics",
      "General",
      "Media Tie-In",
      "children's books",
      "juvenile works",
      "Teen & Young Adult literature",
      "English Fantasy fiction",
      "Specimens",
      "Juvenile Fantasy fiction",
      "Toy and movable books",
      "Magic in fiction",
      "Open Library Staff Picks",
      "juvenile literature",
      "Pictorial works",
      "Magic",
      "Quests (Expeditions)",
      "Graphic novels",
      "Dragons in fiction",
      "Children's stories",
      "Ficción fantástica inglesa",
      "Fantasy in fiction",
      "Translations into Russian",
      "Ficción",
      "Middle Earth (Imaginary place)",
      "Tierra Media (Lugar imaginario)",
      "Bilbo Baggins (Fictitious character)",
      "Dwarfs",
      "Comic books, strips",
      "Reading Level-Grade 11",
      "Reading Level-Grade 12",
      "British and irish fiction (fictional works by one author)",
      "Fiction, fantasy, general",
      "Middle earth (imaginary place), fiction",
      "Comics & graphic novels, fantasy",
      "Science fiction, fantasy, horror",
      "Child and youth fiction",
      "Gollum (Fictitious character)",
      "Hobbits (Fictitious characters)",
      "Baggins, bilbo (fictitious character), fiction",
      "Children's fiction",
      "Gandalf (fictitious character), fiction",
      "Baggins, frodo (fictitious character), fiction",
      "Characters",
      "Characters and characteristics",
      "Hobbit, an unexpected journey (Motion picture)",
      "Hobbit (Tolkien, J.R.R.)",
      "YOUNG ADULT FICTION / Classics",
      "YOUNG ADULT FICTION / Fantasy / General",
      "YOUNG ADULT FICTION / Media Tie-In",
      "Motion pictures",
      "Fiction, fantasy, epic",
      "English literature",
      "Fiction, media tie-in",
      "Large type books",
      "Wizards",
      "Dragons",
      "Courage",
      "Literatura angielska dla młodzieży",
      "Tłumaczenia polskie"
    ],
    "pages": 320,
    "year": 1986,
    "synopsis": "tolkien's Famous Saga, The Prelude To The <i>lord Of The Rings</i>, Has All The Ingredients Of Fantasy And Adventure&#58; Dwarves, Elves, Goblins And Trolls, A Fearsome Dragon, A Great Wizard, A Perilous Quest And A Dramatic Climax. At The Centre Is The Unsuspecting Hero Bilbo Baggins, A Home-loving Unambitious Hobbit Who Is Suddenly Thrust Into The Biggest, Indeed The Only Adventure Of His Life. The Radio Dramatisation Of <i>the Hobbit</i> Became A Classic When It Was First Broadcast On Bbc Radio 4 In 1968 And It Continues To Delight Today.<h3>horn Book Guide</h3>all Those, Young Or Old, Who Love A Finely Imagined Story, Beautifully Told, Will Take The Hobbit To Their Hearts."
  },
  {
    "_id": "0375703950",
    "title": "Ocean Sea",
    "cover": "https://images.isbndb.com/covers/20721003482321.jpg",
    "pages": 256,
    "year": 2000,
    "synopsis": "\"Exotic...erotic... <b>Ocean Sea</b> is highly romantic and breathtakingly lyrical.\"—<i>The New York Times Book Review</i>\nWith <b>Silk</b>, his first novel to appear in English, Alessandro Baricco immediately proved himself to be a magical storyteller. With <b>Ocean Sea</b>, he has been acclaimed as the successor to Italo Calvino, and a major voice in modern literature.\nIn <b>Ocean Sea</b>, Alessandro Baricco presents a hypnotizing postmodern fable of human malady—psychological, existential, erotic—and the sea as a means of deliverance. At the Almayer Inn, a remote shoreline hotel, an artist dips his brush in a cup of ocean water to paint a portrait of the sea. A scientist pens love letters to a woman he has yet to meet. An adulteress searches for relief from her proclivity to fall in love. And a sixteen-year-old girl seeks a cure from a mysterious condition which science has failed to remedy. When these people meet, their fates begin to interact as if by design. Enter a mighty tempest and a ghostly mariner with a thirst for vengeance, and the Inn becomes a place where destiny and desire battle for the upper hand. Playful, provocative, and ultimately profound, <b>Ocean Sea</b> is a novel of striking originality and wisdom."
  },
  {
    "_id": "0376026081",
    "title": "Fresh Ways with Salads:  As Side Dishes or Main Courses (Sunset)",
    "cover": "https://images.isbndb.com/covers/23942293482321.jpg",
    "pages": 96,
    "year": 1987,
    "synopsis": "In an age fascinated by both fitness and good food, salad has naturally come into its own. No longer a quiet plate of greens, salad today has become an adventure that greets your palate with everything from radicchio curls to cactus pads. Even its appearance has changed--instead of simply being tossed together, salads are often as carefully composed as a work of art."
  },
  {
    "_id": "038039586X",
    "title": "Watership Down",
    "cover": "https://images.isbndb.com/covers/11468493482323.jpg",
    "genres": [
      "Fiction",
      "Action & Adventure"
    ],
    "pages": 478,
    "year": 1975,
    "synopsis": "An Allegorical Tale Of Survival In Which A Band Of Wild Rabbits Leave Their Ancestral Home To Build A More Humane Society"
  },
  {
    "_id": "0380805669",
    "title": "Sea Feather (An Avon Camelot Book)",
    "cover": "https://images.isbndb.com/covers/15566453482323.jpg",
    "genres": [
      "Chincoteague Pony"
    ],
    "pages": 74,
    "year": 1999,
    "synopsis": "Alison And Her Sister May Find The Pony Of Their Dreams At The Chincoteague Island Wild Pony Auction."
  },
  {
    "_id": "0385267746",
    "title": "The Design of Everyday Things",
    "cover": "https://images.isbndb.com/covers/4015733482325.jpg",
    "genres": [
      "Industrial design--Psychological aspects",
      "Human engineering",
      "Ergonomics",
      "Psychology, Industrial",
      "TS171.4 .N67 1990",
      "TS 171.4 N842p 1990",
      "620.8/2"
    ],
    "pages": 272,
    "year": 1990,
    "synopsis": "Even The Smartest Among Us Can Feel Inept As We Fail To Figure Our Which Light Switch Or Oven Burner To Turn On, Or Whether To Push, Pull, Or Slide A Door. The Fault, Argues This Book, Lies Not In Ourselves, But In Product Design That Ignores The Needs Of Users And The Principles Of Cognitive Psychology. The Problems Range From Ambiguous And Hidden Controls To Arbitrary Relationships Between Controls And Functions, Coupled With A Lack Of Feedback Or Other Assistance And Unreasonable Demands On Memorization. The Book Presents Examples Aplenty, Among Them, The Vcr, Computer, And Office Telephone, All Models Of How Not To Design For People. But Good, Usable Design Is Possible. The Rules Are Simple: Make Things Visible, Exploit Natural Relationships That Couple Function And Control, And Make Intelligent Use Of Constraints. The Goal: Guide The User Effortlessly To The Right Action On The Right Control At The Right Time. But The Designer Must Care. The Author Is A World-famous Psychologist And Pioneer In The Application Of Cognitive Science. His Aim Is To Raise The Consciousness Of Both Consumers And Designers To The Delights Of Products That Are Easy To Use And Understand. The Psychopathology Of Everyday Things -- The Psychology Of Everyday Actions -- Knowledge In The Head And In The World -- Knowing What To Do -- To Err Is Human -- The Design Challenge -- User-centered Design. Donald A. Norman. Reprint. Originally Published: The Psychology Of Everyday Things. New York : Basic Books, C1988. Includes Index. Includes Bibliographical References (p. 241-247)."
  },
  {
    "_id": "0385412614",
    "title": "My Favorite Summer 1956",
    "cover": "https://images.isbndb.com/covers/5464373482325.jpg",
    "genres": [
      "Sports & Adventure Biography",
      "Baseball & Softball"
    ],
    "pages": 246,
    "year": 1991,
    "synopsis": "Mickey Mantle, the hayseed kid from Spavinaw, Oklahoma, was in his sixth year with the Yankees. He was already America's homerun king. He was about to become a national hero. 1956 would be a record-breaking season: the golden summer fans would remember forever. Now Mickey Mantle brings it all back just the way it happened--spectacular playing on field, crazy hijinks with Whitey Ford and Billy Martin off. There never was a time like it before in baseball. There never will be again. It was magic."
  },
  {
    "_id": "0425185338",
    "title": "Secrets of the Tsil Café: A Novel with Recipes",
    "cover": "https://images.isbndb.com/covers/9990583482339.jpg",
    "pages": 304,
    "year": 2002,
    "synopsis": "A bittersweet and often funny coming-of-age story set in a cross-cultural and extended family that lives between two kitchens-one traditional, the other New World.<br>\n<br>\nWeston Hingler's crib was in the kitchen of BuenAppeTito, his mother's catering service. There, he learned to read while tasting all the flavors of his mother's culinary alphabet. <br>\n<br>\nBut before he was allowed to enter the Tsil Café, he had to pass his father's taste tests. Anchovies. Haba–ero chiles. Chipotle peppers. Food to purge body and soul. Food his loving but sometimes volatile father uses as a measure of family, friends, and enemies.<br>\n<br>\nCaught between these two kitchens, Weston quickly learns that he's also trapped by his wayward parents' secrets and histories, infidelities and gaping needs, as well as by the Café customers and employees who are privy to his growing up.<br>\n<br>\nWeston chooses his escapes intuitively, but he can't get away. In this layered and savory novel, food is the reflection of life's shifting flavors, and readers will be drawn to the delicious package in which Averill delivers his story-complete with recipes. But ultimately they'll attach to Weston's complicated family, and when Averill serves us their feasts of reconciliation, readers will want to raise a toast. \nAuthor Biography: Thomas Fox Averill has published two story collections, <i>Passes at the Moon</i> and <i>Seeing Mona Naked</i>. A graduate of the Iowa Writers' Workshop and an O. Henry Award winner, Averill is writer-in-residence and a professor of English at Washburn University in Topeka, Kansas."
  },
  {
    "_id": "0439314348",
    "title": "Electric Storm: Magic School Bus Chapter Book #14",
    "cover": "https://images.isbndb.com/covers/10851673482344.jpg",
    "pages": 96,
    "year": 2003,
    "synopsis": "Hi, I'm Keesha -- one of the kids in Ms. Frizzle's class. When Ms. Frizzle announced that we'd be studying the weather, I thought it would be pretty boring. Boy, was I wrong! Ms. Frizzle promised to take us on a field trip that would give us a real jolt of excitement -- little did we know what we had in mind. Before we knew it, we'd become a bolt of lightning and we were off on an electrifying adventure!"
  },
  {
    "_id": "0439343895",
    "title": "Puppy in a Puddle (Animal Ark Series #28)",
    "cover": "https://images.isbndb.com/covers/11147173482344.jpg",
    "pages": 144,
    "year": 2003,
    "synopsis": "<br>When Mandy's dad diagnoses an Old English Sheepdog puppy as deaf, Mandy feels sorry for it. But it isn't until she finds another Sheepdog puppy weak and abandoned that she and James begin to get suspicious. Could a local breeder be mistreating these poor puppies? It's up to Mandy and James to save them!<br>"
  },
  {
    "_id": "044669259X",
    "title": "Beauty for Ashes: Receiving Emotional Healing",
    "cover": "https://images.isbndb.com/covers/376823482347.jpg",
    "genres": [
      "Abuse & Violence",
      "Religious Inspiration for the Sick",
      "Disabled & Recovering",
      "General & Miscellaneous Christian Life"
    ],
    "pages": 272,
    "year": 2003,
    "synopsis": "<P>Many people seem to have it all together outwardly, but inside they are a wreck. Their past has broken, crushed, and wounded them inwardly. They can be healed. God has a plan, and Isaiah 61 reveals that the Lord came to heal the brokenhearted. He wants to heal victims of abuse and emotional wounding. Joyce Meyer is a victim of the physical, mental, emotional, and sexual abuse she suffered as a child. Yet today she has a nationwide ministry of emotional healing to others like herself. In Beauty for Ashes she outlines major truths that brought healing in her life and describes how other victims of abuse can also experience God's healing in their lives. You will learn&#58; <br>&bull; How to Deal with the Emotional Pain of Abuse <br>&bull; How to Understand Your Responsibility to God for Overcoming Abuse <br>&bull; Why Victims of Abuse Often Suffer from Other Addictive Behaviors <br>&bull; How to Grab Hold of God's Unconditional Love <br>&bull; The Importance of God's Timing in Working Through Painful Memories."
  },
  {
    "_id": "0452281741",
    "title": "Animal Connection, The: A Guide to Intuitive Communicationwith Your Pe",
    "cover": "https://images.isbndb.com/covers/96743482349.jpg",
    "genres": [
      "Pets",
      "Behavior",
      "Human-animal Communication",
      "Animal Communication"
    ],
    "pages": 208,
    "year": 2000,
    "synopsis": "A remarkable guide that will help you discover and develop your ability to communicate with pets.<br>\n<br>\nThere's a big communication gap between animal lovers and their pets. How can we bridge that gap? Judy Meyer reveals how we can develop our innate ability to communicate with animals and become more deeply attuned to their needs and desires. All we need is a little refresher course--and a willingness to try.<br>\n<br>\nIn her book, Meyer provides clear, step-by-step directions on how to get in touch with your intuitive power to speak and listen to the animals you love. <i>The Animal Connection</i> includes nine exercises designed to open up the channels of communication and draws on Meyer's extensive experience as an animal communicator with more than eight hundred clients throughout the world. This one-of-a-kind guide will not only give you the communication tools you need to redirect \"unacceptable\" behavior in your pet but will also foster a more meaningful relationship between you and your animal companion.\nAn animal communicator, Judy Meyer has been helping people understand their pets since 1990. She has more than eight hundred clients worldwide."
  },
  {
    "_id": "0517250527",
    "title": "The Color Nature Library: Cats",
    "cover": "https://images.isbndb.com/covers/3811373482372.jpg",
    "pages": 64,
    "year": 1984,
    "synopsis": "A Photographic Display Of A Variety Of Cats."
  },
  {
    "_id": "0517881721",
    "title": "Hear Me Roar: Women, Motorcycles, and the Rapture of the Road",
    "cover": "https://images.isbndb.com/covers/10123413482372.jpg",
    "pages": 211,
    "year": 1996,
    "synopsis": "Hear Me Roar: Women, Motorcycles, And The Rapture Of The Road Chronicles The Bold World Of Women In Motorcycling The Independence, The Excitement, The Myths, The History, The Subcultures. Ann Ferrar, A Motorcycling Journalist Who Crisscrossed The Continent On A Hawk Gt 650, Has Written A Book Full Of Stories And Photographs Of Pioneering Women And Their Freedom Machines - From The First Grande Dames Of Motorcycling At The Turn Of The Century To The Drag Racers, Endurance. Riders, Stuntwomen, Motocrossers, Bikers' - Rights Activists, Adventurers, And World Explorers Of Today. Hear Me Roar Also Presents A Unique Perspective On A Little-known Facet Of Women's Independence, And Goes Behind The Scenes To Look At Female Strength In Motorcycle Sports: The Rise Of The Fastest Woman On A Harley Nitro Bike, The Toil And Perseverance Of A Female Team In A Superbike Relay Race. Their Stories Are All Here For The First Time In Fascinating Detail. And, For Newcomers And Veteran Riders Alike, Hear Me Roar Provides A Comprehensive Reference Section With Practical Information About Motorcycle Safety, How To Choose A Bike And Leather Gear, Plus A National Resource Directory With 450 Listings For Women's And Coed Clubs, Manufacturers, Periodicals, Where To Find Specialty Parts To Customize A Bike, And Much More. Introduction -- Unsung Heroines: Turning A New Page In Herstory -- 1. Everywoman As A Rebel: The Voices Of Women Who Ride -- 2. Incredible Women And Their Freedom Machines: A Chronicle, From The Turn Of The Century To The Fifties -- 3. We've Ridden A Long Way: A Chronicle, From The Sixties To The Present -- 4. From Biker Chic To B Movies: The Motorcycle Woman As A Icon To Glamorize -- And To Trash -- 5. Zoom And The Art Of Motorcycle Madness: Women Who Drag-race Harleys -- 6. Road Warriors: Women Who Race Superbikes -- 7. Cowgirls On Wheels: Women Who Race Motocross -- 8. Flying Solo: Adventurers And Explorers -- 9. A Biker's Social Calendar: Rallies, Runs, And Watering Holes -- 10. About Bikes: A Primer On Choosing A First Motorcycle, With Tips On Lowering Ride Height -- 11. Basic Motorcycle Safety And Risk Management, With Tips On Choosing Protective Gear -- Appendix -- Riders' Resource Directory. By Ann Ferrar ; With Photographs By The Author. Includes Bibliographical References (p. 206-207) And Index."
  },
  {
    "_id": "0521413230",
    "title": "Predicting the Future (Darwin College Lectures, Series Number 5)",
    "cover": "https://images.isbndb.com/covers/17352703482373.jpg",
    "pages": 201,
    "year": 1993,
    "synopsis": "Auguries, Oracles, Omens ... And Software Simulation. From Antiquity To The Electronic Age, Predicting The Future Examines Humankind's Obsessive Urge To Look Beyond The Present In The Hope Of Controlling Events In The Days To Come. Opening With Stephen Hawking's Predictions About The Billion Year Future Of The Universe, Closing With Don Cupitt's Insights Into The Last Judgement, The Book Examines Both The History Of Prediction And The Ways We Set About Foretelling The Future Today. In The Past Soothsayers, Diviners, Holy Men And Astrologers Made Prophecies On The Basis Of Religious Ideology And Traditional Authority. Today Accredited Experts Predict The Future, Of The Economy, Of Medicine's Place In Society, Of The Entire Universe, On The Basis Of Empirical Observation And Scientific Theory. Yet As All The Contributors Admit, Prediction Remains An Uncertain Business Even In The Computer Age, Steering A Hazardous Course Between Scaremongering And Complacency, Liable Always To Be Thrown Dramatically Off Course By Human Unpredictability, Catastrophic Change, Or Faulty Initial Data. The Book Originates In The Sixth Annual Series Of Darwin College Lectures, Delivered In Cambridge In 1991 Under The Title 'predictions'. The Contributors Include Leo Howe On Predicting The Future; Stephen Hawking On The Future Of The Universe; Ian Stewart On Chaos; Simon Schaffer On Comets; Frank Hahn On The Economy; Ian Kennedy On Medicine; Averil Cameron On Divine Providence In Antiquity; Richard Gombrich On Buddhist Prediction; And Don Cupitt On The Last Judgement. Introduction: Predicting The Future / L. Howe -- The Future Of The Universe / S. Hawking -- Chaos / I. Stewart -- Comets And The World's End / S. Schaffer -- Predicting The Economy / F. Hahn -- The Medical Frontier / I. Kennedy -- Divine Providence In Late Antiquity / A. Cameron -- Buddhist Prediction: How Open Is The Future? / R. Gombrich -- The Last Judgement / D. Cupitt. Edited By Leo Howe And Alan Wain. The Darwin College Lectures. Includes Bibliographical References And Index."
  },
  {
    "_id": "0553156373",
    "title": "Horse Power (Saddle Club(R))",
    "cover": "https://images.isbndb.com/covers/25840433482384.jpg",
    "pages": 144,
    "year": 1989,
    "synopsis": "carole, Stevie, And Lisa Have Been Looking For A Fourth Member To Join The Saddle Club. So When Carole Introduces Her Friends To Kate Devine, The Championship Rider, The Girls Know They've Found The Perfect Fit. Except That Kate Doesn't Want To Ride Ever Again. . . .<h3>children's Literature</h3>watch Out Horse Lovers, They Are Back! Three Twelve- And Thirteen- Year Old Girls Who Seemingly Have Nothing In Common, Other Than Their Crazy Obsession For Horses, Have Formed A Group Called The Saddle Club. The Members Are Lisa, The Ambitious Brainy One; Stevie, Who Is The Opposite Type Of Student And Always Looking For Some Mischievous Fun To Get Into; And Carole, The Somewhat Absentminded Yet Accomplished Rider. In This Slim Book, The Girls Are Preparing For A Gymkhana, Where Teams Of Riders Compete In Games Against One Another On Horseback. They Are Looking For A Fourth Member For Their Club And Believe They Have Found Her In Kate. But Why Did Kate Choose Not To Divulge The Fact That She Is A Championship Rider Upfront? Horse Enthusiasts Will Enjoy The Animal Scenes, And Other Readers Will Enjoy The Great Friendships The Girls Have. A Little Boyfriend Side Story Is Included Too. Not An Intellectual Read, But Equivalent To A Beach Read For The Tween Set. Part Of The The Saddle Club."
  },
  {
    "_id": "0590939874",
    "title": "The Kid Who Ran for President",
    "cover": "https://images.isbndb.com/covers/10474323482398.jpg",
    "genres": [
      "Elections",
      "Fiction",
      "Politics, Practical"
    ],
    "pages": 156,
    "year": 1996,
    "synopsis": "With His Friend As Campaign Manager And His Former Babysitter As Running Mate, Twelve-year-old Judson Moon Sets Out To Become President Of The United States."
  },
  {
    "_id": "0671774786",
    "title": "Section 31: Shadow (Star Trek Voyager)",
    "cover": "https://images.isbndb.com/covers/4335503482427.jpg",
    "pages": 272,
    "year": 2001,
    "synopsis": "They are the self-appointed protectors of the Federation. Amoral, shrouded in secrecy, answerable to no one, Section 31 is the mysterious covert operations division of Starfleet, a rogue shadow group committed to safeguarding the Federation at any cost.\nSomeone or some<i>thing</i> is trying to kill Seven of Nine. As the crew races against time to save millions of refugees from an imminent stellar cataclysm, the former Borg becomes the target of several seemingly random but potentially lethal \"accidents.\" The investigation reveals a truth more terrifying than anyone ever imagined, as Captain Kathryn Janeway and the crew of the <i>Starship Voyager</i> fight for their lives against the most unexpected enemy of all."
  },
  {
    "_id": "0684821427",
    "title": "Con Tricks: The Shadowy World of Management Consultancy and How to Make It Work for You (Simon & Schuster Business Books)",
    "cover": "https://images.isbndb.com/covers/22458803482431.jpg",
    "pages": 320,
    "year": 1999,
    "synopsis": "Knowing how to handle management consultants may be vital to a manager's career. This iconoclastic business book presents advice on getting value for money from consultants, what pitfalls to watch out for, and what tricks of the trade consultants might try to use."
  },
  {
    "_id": "0688175023",
    "title": "Country Living Decorating with Candles: Accents for Every Room",
    "cover": "https://images.isbndb.com/covers/27908953482432.jpg",
    "genres": [
      "Home Lighting",
      "Decorating - General & Miscellaneous"
    ],
    "pages": 112,
    "year": 2000,
    "synopsis": "<b>Country Living magazine throws some beautiful light on one of today's most popular decorating items: the candle. Whether for a party or a romantic dinner, these design concepts are truly illuminating.</b>Candles warm the heart and lighten the spirit, so enjoy their soothing effect any time of year, indoors or out, with Country Living's enlightening decorating ideas. Use candles' flickering golden light to brighten a porch, add charm to a table setting, and dramatize a space. Place candles in an alluring array of holders and arrange them on shelves. Gently illuminate a hallway with lighted candles set in traditional sconces. Try a little bathtime aromatherapy with fragrant candles that enhance relaxation. Those who need a helping hand with practical matters will find a special section devoted to the finer points of buying, using, and even making container candles and ice lanterns."
  },
  {
    "_id": "0689855826",
    "title": "Christmas Crisis (Sabrina, the Teenage Witch)",
    "cover": "https://images.isbndb.com/covers/16631183482433.jpg",
    "pages": 160,
    "year": 2003,
    "synopsis": "This holiday season Sabrina's shopping list is a lot bigger than her bank account. To make some extra cash, Sabrina gets a part-time job as one of Santa's elves in the mall. But when things get frantic, Sabrina conjures up loads of toys to calm down cranky kids.\nTrouble is, Sabrina zapped the toys from the real Santa's carefully calculated stock, and they're not easily replaced. If Sabrina's going to save Christmas, she's going to have to catch the next sleigh to the North Pole and roll up her sleeves in Santa's workshop!\n\n\n                        After zapping some toys from Santa's workshop, Sabrina has to catch the next sleigh to the North Pole and roll up her sleeves in Santa's workshop.\n"
  },
  {
    "_id": "069620682X",
    "title": "Best Bread Machine Recipes: For 1 1/2- and 2-pound loaves (Better Homes and Gardens Test Kitchen)",
    "cover": "https://images.isbndb.com/covers/23969603482435.jpg",
    "genres": [
      "Kitchen Equipment",
      "Breads & Muffins"
    ],
    "pages": 128,
    "year": 1997,
    "synopsis": "Best Bread Machine RecipesMore than 3.5 million bread cookbooks sold!<ul><li>A total of 80 recipes featuring a variety of flavorsÃ¹sweet and savoryÃ¹that make use of a bread machine's convenient and timesaving features.</li><li>Also: recipes give ingredient amounts for both 11/2-pound and 2-pound loaves; machine settings are specified for each recipe; you are shown how to convert conventional bread recipes into bread machine recipes; Nutrition Facts given with every recipe.</li><li>Every recipe is tested in bread machines from a variety of manufacturers to ensure success, and answers to questions that are commonly asked of the Test Kitchen home economists help you solve specific bread machine baking problems.</li></ul>"
  },
  {
    "_id": "0732257182",
    "title": "Café Royale: Tales of love & travel",
    "cover": "https://images.isbndb.com/covers/19357953482448.jpg",
    "pages": 282,
    "year": 1997,
    "synopsis": "Café Royale -- Bloody Mary's -- The Sea Breeze -- The Pale Café Of The Unexplained -- The Blue Man -- The Pearl Of The Orient -- The Custard Man -- Café 300 -- Café Lune -- The Café Bar -- The Air Bar -- The Cafés Of Paris. Larry Buttrose."
  },
  {
    "_id": "0764152777",
    "title": "A Practical Guide to Keeping Healthy Fish in a Stable Environment (Tankmasters Series)",
    "cover": "https://images.isbndb.com/covers/1284313482460.jpg",
    "pages": 77,
    "year": 2001,
    "synopsis": "Detailed instruction advises on water temperature and chemistry, gravels, and the best equipment to help maintain a healthful environment for aquarium fish. Aquarium hobbyists improve their skills by studying the clearly captioned, step-by-step, full-color photos on every page of <i>Tankmasters Books</i>. These books. show—rather than merely tell—how to maintain colorful and interesting fish tanks, with every page literally filled with photos and other illustrations. All have detailed and instructive captions. Each book focuses on a different aspect of either freshwater or marine aquarium maintenance, and explains everything from fish and plant varieties to bubblers, filters, and other aquarium accessories. More than 200 illustrations in each book."
  },
  {
    "_id": "0764586009",
    "title": "On Lee's To Kill a Mockingbird (Cliffs Notes)",
    "cover": "https://images.isbndb.com/covers/5616623482460.jpg",
    "pages": 99,
    "year": 2000,
    "synopsis": "The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background. The latest generation of titles in this series also feature glossaries and visual elements that complement the classic, familiar format.\nIn <i>CliffsNotes on To Kill a Mockingbird,</i> you explore Harper Lee's literary masterpiece — a novel that deals with Civil Rights and racial bigotry in the segregated southern United States of the 1930s. Told through the eyes of the memorable Scout Finch, the novel tells the story of her father, Atticus, as he hopelessly strives to prove the innocence of a black man accused of raping and beating a white woman.\nChapter summaries and commentaries take you through Scout's coming of age journey. Critical essays give you insight into racial relations in the South during the 1930s, as well as a comparison between the novel and its landmark film version. Other features that help you study include\n<ul>\n<li>Character analyses of the main characters</li>\n<li>A character map that graphically illustrates the relationships among the characters</li>\n<li>A section on the life and background of Harper Lee</li>\n<li>A review section that tests your knowledge</li>\n<li>A Resource Center full of books, articles, films, and Internet sites</li>\n</ul>\nClassic literature or modern modern-day treasure — you'll understand it all with expert information and insight from CliffsNotes study guides."
  },
  {
    "_id": "0789405652",
    "title": "101 Essential Tips: House Plants",
    "cover": "https://images.isbndb.com/covers/1041033482469.jpg",
    "pages": 72,
    "year": 1996,
    "synopsis": "The step-by-step series that brings expert advice at an affordable price, breaks down plant care into 101 easy-to-grasp tips, and gives answers to all questions."
  },
  {
    "_id": "0789414252",
    "title": "P.B. Bear Board Book: Words",
    "cover": "https://images.isbndb.com/covers/1126993482469.jpg",
    "pages": 14,
    "year": 2001,
    "synopsis": "Kids will enjoy learning words, colors, numbers, and shapes from a trusted friend. Pajama Bedtime Bear introduces each concept with photos of familiar objects to reinforce important early learning connections. This lovable character, formerly of Nickelodeon's \"Pajama Bedtime Bear and Friends\", touches the heart of both parents and children. The complete line of Pajama Bedtime Bear books help introduce first concepts and words and prepare children to read. This trustworthy bear has a proven track record and can allow your children to have fun while learning."
  },
  {
    "_id": "0789454114",
    "title": "DK Readers: Big Machines (Level 1: Beginning to Read) (DK Readers Level 1)",
    "cover": "https://images.isbndb.com/covers/1525683482469.jpg",
    "genres": [
      "Construction Equipment",
      "Machinery"
    ],
    "pages": 32,
    "year": 2000,
    "synopsis": "A multi-level learning-to-read program combining Dorling Kindersley's highly visual style with appropriate stories at four levels. Stunning photographs plus engaging stories combine in Dorling Kindersley Readers to create a structured reading program with appeal for every beginning reader. The age-appropriate text is guaranteed to capture a child's interest while developing reading skills and general knowledge.\n\n                        Demonstrates how the crane, bulldozer, dump truck, and other construction machines all play a part in building a new park.\n"
  },
  {
    "_id": "0789467747",
    "title": "The Secrets of Bach Flower Remedies",
    "cover": "https://images.isbndb.com/covers/1661933482469.jpg",
    "genres": [
      "Flowers",
      "Therapeutic Use"
    ],
    "pages": 224,
    "year": 2000,
    "synopsis": "The ultimate holistic therapy, the flower remedies discovered by Dr. Edward Bach in the late in 1920s and 30s are a safe, natural way of dealing with the negative emotions that he believed are a cause of disease. This accessible guide reveals the secrets of the \"twelve healers\"—the plants that formed the basis of Bach's observations—and the further twenty-six remedies that he went on to discover. Drawing on the innate healing powers of specific wild flowers, the remedies help individuals balance their emotions. Learn to use these simple, effective remedies and enable your emotions to flow freely and positively once more.\nHere is an exciting new series focused on today's most popular healing approaches and spiritual insights. Presented in a clear, concise format, the Secrets of Series demystifies popular alternative approaches and teaches proper application, providing a perfect balance of theory and practice. Perfect for new or casual readers, these handbooks are simple to follow yet thorough and authoritative. Covering a wide range of topics, they appeal to readers from every background.\nAuthor Biography: Jeremy Harwood has worked in publishing for more than 30 years. His interest in complementary medicine—particularly herbalism—was sparked by his discovery of a handwritten Victorian collection of traditional folk remedies. Since then he has edited and contributed to several books on the subject.\nNatural Health is the leading periodical in the field of natural health and self care. Published by Weider Publications, Inc., its editorial advisory board includes such esteemed authorities as Dean Ornish, Carolyn Dean, and Andrew Weil."
  },
  {
    "_id": "0805072403",
    "title": "Out of the Blue: A Narrative of September 11, 2001",
    "cover": "https://images.isbndb.com/covers/17279563482474.jpg",
    "genres": [
      "September 11 Terrorist Attacks, 2001",
      "Terrorism",
      "Terrorism--United States",
      "Victims of terrorism",
      "Victims of terrorism--New York (State)--New York",
      "HV6432 .B47 2002",
      "973.931"
    ],
    "pages": 304,
    "year": 2002,
    "synopsis": "<b>A gripping and authoritative account of the September 11th attack, its historical roots, and its aftermath</b>\nFew news stories in recent memory have commanded as much attention as the terrorist attacks on the World Trade Center and the Pentagon, but no news organization rivaled <i>The New York Times</i> for its comprehensive, resourceful, in-depth, and thoughtful coverage. This effort may well emerge as the finest hour in the paper's distinguished 150-year history.\nIn an unprecedented commitment, the <i>Times</i> assigned one of its most skilled reporters, Richard Bernstein, to turn the newspaper's brilliant and incisive reporting into a riveting narrative of September 11th. Following the lives of heroes, victims, and terrorists, Bernstein weaves a complex tale of a multitude of lives colliding in conflagration on that fateful morning. He takes us inside the Al Qaeda organization and the lives of the terrorists, from their indoctrination into radical Islam to the harrowing moments aboard the aircraft as they raced toward their terrible destiny. We meet cops and firefighters, and become intimate with some of the Trade Center workers who were lost on that day. We follow the lives of the rest of America-ordinary citizens and national leaders alike-in the hours and days after the attack.\nFinally, Bernstein chronicles the nation's astonishing response in the aftermath.\nNo account of this singular moment in American history will be as sharp, readable, and authoritative as <i>Out of the Blue</i>."
  },
  {
    "_id": "0824512170",
    "title": "Mythological Woman: Contemporary Reflections on Ancient Stories",
    "cover": "https://images.isbndb.com/covers/15076713482481.jpg",
    "genres": [
      "Women and religion",
      "Women--Mythology",
      "BL458 .C35 1992",
      "291.2/114"
    ],
    "year": 1993,
    "synopsis": "Old Europe And Classical Greece -- Asian Cultures -- Near Eastern Cultures -- Recent Oral Cultures. Denise Lardner Carmody. Amaterasu -- Artemis -- Buffalo Maiden -- Eschetewuarha -- Fatimah -- Hera -- Inanna -- Isis -- Kali -- Kuma -- Lady Wisdom -- Laksmi -- Lilith -- Moon Godess -- Oshun -- Radha -- Rainbow Snake -- Sedna -- Shekhinah -- Sophia -- Tara -- Virgin Mary. Includes Bibliographical References."
  },
  {
    "_id": "0873226771",
    "title": "Snowboarding (Outdoor Pursuits)",
    "cover": "https://images.isbndb.com/covers/24764343482498.jpg",
    "pages": 144,
    "year": 1994,
    "synopsis": "Here is the source for readers who want to learn more about the fastest-growing outdoor winter sport—<i>Snowboarding</i>!\nThis book helps beginners get started and veterans get better. <i>Snowboarding</i> includes advice on selecting the right board and accessories, in-depth explanations of key snowboarding skills, safety tips, and detailed descriptions of 20 of the world's best snowboarding resorts—from authors who have been there.\nThe book features clear and accurate instruction and beautiful full-color photos and illustrations throughout for demonstrating proper technique. Less-experienced riders will discover tips for waxing and storing boards and sharpening their edges, along with advice for falling safely and riding through soft snow. More advanced participants will learn how to get started in freestyle, racing, and riding on ungroomed trails. And everyone will appreciate the hints on handling crowds and finding the best snow.\nSnowboarders looking for places to try their skill will be pleased to read about 20 of the finest snowboarding destinations in the U.S., Canada, Europe, Australia, and New Zealand. The descriptions of each resort include\n- vertical drop,<br>\n- summit elevation,<br>\n- number of lifts,<br>\n- size of the area,<br>\n- resort access,<br>\n- where to write for information, and<br>\n- snowmaking capabilities.\nReaders will also find a complete fitness program to help them prepare for their time on the slopes, along with practical advice for coping with high altitudes. There is even a glossary of snowboard-speak to help readers master the lingo of this rapidly evolving sport.\nLike all the books in the Outdoor Pursuits Series, <i>Snowboarding</i> emphasizes safety, environmental responsibility, and—most of all—the fun of outdoor activity!\n\n\n                        The source for readers who want to learn more about the fast-growing outdoor winter sport of snowboarding. Features clear and accurate instruction and beautiful full-color photographs and illustrations throughout for demonstrating proper technique. Includes 20 of the finest snowboarding destinations worldwide.\n"
  },
  {
    "_id": "0895295121",
    "title": "Juicing for Life: A Guide to the Benefits of Fresh Fruit and Vegetable Juicing",
    "cover": "https://images.isbndb.com/covers/20761513482506.jpg",
    "genres": [
      "Fruit Juices",
      "Health Aspects",
      "Vegetable Juices"
    ],
    "pages": 368,
    "year": 1991,
    "synopsis": "Filled with exciting new information, The Juice Lady's Juicing for Health and Healing offers new remedies, research, recipes, and answers to common questions from Cherie Calbom's millions of fans and readers.<P>The Juice Lady's Juicing for Health and Healing shows how anyone can use delectable fresh fruit and vegetable juice combinations to help lower cholesterol, overcome jet lag, boost the immune system, slow the aging process, lose weight, look more beautiful, reduce the risk of many serious diseases, and relieve scores of common ailments, including arthritis, chronic fatigue, hypertension ... even cellulite!<P>After relating her own story of juicing her way to health, Cherie reveals how juicing can supercharge anyone's personal nutrition program, offers juice recipes with specific health benefits, presents a section of juice-related \"Health Boosters\" and \"Beauty Boosters\", and relays \"Stories of Hope\": selections from the countless letters she has received from readers attesting to the renewed health and vitality they found through Cherie's juicing and dietary program. <h3>Publishers Weekly</h3> While Calbom and Keane promise no quick fix for various ailments, their simple-to-prepare natural ``potions'' fit the contemporary demand for instant--and healthful--gratification. Arranged alphabetically by ills (which range from acne to age spots to chronic fatigue syndrome, varicose veins and water retention), juice ``cures'' are touted here as ``vitamin and mineral cocktails'' that can detoxify the body and supplement the diet. Many of the same juice recipes work on sundry and specific ills; recipes for potassium broth, ``very veggie'' cocktail, ``Cherie's cleansing cocktail,'' ``ginger hopper,'' ``garlic express'' and ``chlorophyll cocktail'' are among the repeated panaceas. At the very least, juicing raw produce is a relatively direct means of introducing the vegetables recommended by nutritionists into daily habits. So while some will pigeonhole Juicing as just another New Age treatise, others--convinced of the place of the occasional juice fast in the diet--will find the volume fascinating, and well worth the investment in a juicer and organic produce. (Feb.)"
  },
  {
    "_id": "0941807304",
    "title": "Funny Kittens (Welcome Books (Steward Tabori & Chang))",
    "cover": "https://images.isbndb.com/covers/8424853482523.jpg",
    "pages": 72,
    "year": 2000,
    "synopsis": "From a kitten playfully unraveling a woman's dress to a puppy blissfully asleep on the lap of a chimpanzee, Funny Kittens and Funny Puppies will delight animal lovers everywhere. Each book features 50 duotone pictures from notable photographers such as Robin Schwartz and David McEnery, which accompany charming anecdotes. Meet Archy, the kitten who walks around with a paper bag over her head, and Whitey, the puppy who dives into a mound of strawberry jam. Also included are 12 original, light-hearted drawings by J.C. Suares, which enliven these whimsical forays into the world of baby animals.\nFunny Cats and Funny Dogs were first published by Welcome Enterprises in 1995. These lovable collections of duotone photographs, anecdotes, and zany illustrations were instant best-sellers that demanded sequels. Funny Kittens and Funny Puppies are the ninth and tenth books in this popular series, which has sold over 450,000 copies."
  },
  {
    "_id": "1585748668",
    "title": "Snowball Oranges: A Winter's Tale on a Spanish Isle",
    "cover": "https://images.isbndb.com/covers/16192543482752.jpg",
    "pages": 240,
    "year": 2003,
    "synopsis": "It's the stuff of dreams: a Scottish family giving up relative sanity and security to go and grow oranges for a living in a secluded valley in the mountains of the Mediterranean island of Majorca. But dreams, as everyone knows, have a nasty habit of not turning out quite as intended. Being greeted by a freak snowstorm is only the first of many surprises and \"experiences,\" and it isn't long before they realize that they have been sold a bit of a lemon of an orange farm by the wily previous owners.However, laughter is the best medicine when confronted with consuming a local dish of rats, the live-chicken-down-a-chimney technique of household maintenance, and attending a shotgun wedding. The colorful set of Majorcan neighbors (including an eccentric old goatherd who eats worm-ridden oranges to improve his sex life) restores the family's faith in human nature and helps them adapt to a new and unexpectedly testing life in this deceptively simple idyll of rural Spain. Snowball Oranges is hilarious and revealing, full of life and color, set against a backdrop of the breathtaking beauty of Majorca. (6 1/4 x 9 1/4, 240 pages)"
  },
  {
    "_id": "1587610906",
    "title": "I Do: A Guide to Creating Your Own Unique Wedding Ceremony",
    "cover": "https://images.isbndb.com/covers/6729183482753.jpg",
    "pages": 152,
    "year": 2004,
    "synopsis": "Planning a wedding can be an emotional and logistical nightmare, especially if you want your ceremony to be as unique as you are. Well, forget about the three-tiered cake, stop obsessing over what Martha would do, and make your special day a walk down the aisle less traveled with I DO, a creative, accessible guide to designing unique marriage ceremonies. Beginning with an explanation of traditional wedding elements-the bridal veil, the exchange of rings, the cake, the vows-author Sydney Barbara Metrick offers inspired wedding alternatives drawn from ancient Greece and Persia, pagan Europe, and Elizabethan England, among other traditions. Planning guides include sample ceremonies and instructions for personalizing them."
  },
  {
    "_id": "3150006422",
    "title": "Das Nibelungenlied (Universal-Bibliothek Nr. 642)",
    "cover": "https://images.isbndb.com/covers/14985183483309.jpg",
    "year": 1977,
    "synopsis": "übersetzt, Eingeleitet Und Erläutert Von Felix Genzmer."
  },
  {
    "_id": "9814120383",
    "title": "Asia's Best Hotels & Resorts (Insight Guides)",
    "cover": "https://images.isbndb.com/covers/8545103485682.jpg",
    "pages": 320,
    "year": 2003,
    "synopsis": "Based on comments from travellers with first-hand experience, this unique and indispensable guide is packed with new, in-depth and independent reviews of Asia Pacific's 300 best hotels and resorts"
  }
]
